{
    "file_type": "text",
    "file_icon" : "ucbl",
    "file_name" : "Compét. IUT",
    "header": "Compétences",
    "sections": [
        {
            "section_header" : "Compétence 1 : Réaliser un développement d'application",
            "section_contents" : "Concevoir et implémenter des applications en respectant des spécifications, en garantissant l'accessibilité, la qualité et l'intégration en production.",
            "uls" : [
                {
                    "list_title" : "Niveau 1",
                    "list" : [
                        "Implémenter des conceptions simples",
                        "Implémenter des conceptions simples",
                        "Faire des essais et évaluer leurs résultats en regard des spécifications",
                        "Développer des interfaces utilisateurs"
                    ]
                },
                {
                    "list_title" : "Niveau 2",
                    "list" : [
                        "Élaborer et implémenter les spécifications fonctionnelles et non fonctionnelles à partir des exigences",
                        "Appliquer des principes d'accessibilité et d'ergonomie",
                        "Adopter de bonnes pratiques de conception et de programmation",
                        "Utiliser des patrons de conception pour le développement d'applications cohérentes",
                        "Adapter les solutions existantes au contexte applicatif",
                        "Vérifier et valider la qualité de l'application par les tests"
                    ]
                }, 
                {
                    "list_title" : "Niveau 3",
                    "list" : [
                        "Choisir et implémenter les architectures adaptées",
                        "Développer des applications sur des supports spécifiques",
                        "Réaliser un audit d'une application",
                        "Intégrer des solutions dans un environnement de production"
                    ]
                }
            ]
        },
        {
            "section_header" : "Compétence 2 : Optimiser des applications informatiques",
            "section_contents" : "Analyser, comparer et améliorer les performances d'applications informatiques en choisissant des structures et des algorithmes adaptés, tout en tenant compte des enjeux sociétaux et environnementaux.",
            "uls" : [
                {
                    "list_title" : "Niveau 1",
                    "list" : [
                        "Analyser un problème avec méthode (découpage en éléments algorithmiques simples, structure de données...)",
                        "Comparer des algorithmes pour des problèmes classiques (tris simples, recherche...)",
                        "Expérimenter la notion de compilation et les représentations bas niveau des données",
                        "Formaliser et mettre en œuvre des outils mathématiques pour l’informatique"
                    ]
                },

                {
                    "list_title" : "Niveau 2",
                    "list" : [
                        "Choisir des structures de données complexes adaptées au problème",
                        "Utiliser des techniques algorithmiques adaptées pour des problèmes complexes (par ex. recherche opérationnelle, méthodes arborescentes, optimisation globale, intelligence artificielle...)",
                        "Appréhender la différence entre les paradigmes de programmation",
                        "Comprendre les enjeux et moyens de sécurisation des données et du code",
                        "Évaluer l’impact environnemental et sociétal des solutions proposées"
                    ]
                },
                {
                    "list_title" : "Niveau 3",
                    "list" : [
                        "Anticiper les résultats de diverses métriques (temps d’exécution, occupation mémoire...)",
                        "Profiler et analyser le comportement d’un code existant",
                        "Appliquer des méthodes de calcul scientifique (imagerie, immersion, intelligence artificielle, jeux vidéos, parallélisme, calcul formel...)",
                        "Identifier les solutions techniques pour gérer la montée en charge des applications"
                    ]
                }
            ]
        },
        {
            "section_header" : "Compétence 3 : Administrer des systèmes informatiques communicants complexes",
            "section_contents" : "Installer, configurer, sécuriser et administrer des systèmes et réseaux afin de garantir leur bon fonctionnement dans des environnements complexes.",
            "uls" : [
                {
                    "list_title" : "Niveau 1",
                    "list" : [
                        "Identifier les différents composants (matériels et logiciels) d’un système numérique",
                        "Utiliser les fonctionnalités de base d’un système multitâches / multiutilisateurs",
                        "Installer et configurer un système d’exploitation et des outils de développement",
                        "Configurer un poste de travail dans un réseau d’entreprise"
                    ]
                },

                {
                    "list_title" : "Niveau 2",
                    "list" : [
                        "Concevoir et développer des applications communicantes",
                        "Utiliser des serveurs et des services réseaux virtualisés",
                        "Sécuriser les services et données d’un système",
                        "Rédiger une documentation technique (en français et en anglais)"
                    ]
                }
            ]
        },
        {
            "section_header" : "Compétence 4 : Gérer des données de l’information",
            "section_contents" : "Concevoir, interroger, sécuriser et exploiter des bases de données afin de transformer l’information en ressource utile pour l’entreprise.",
            "uls" : [
                {
                    "list_title" : "Niveau 1",
                    "list" : [
                        "Mettre à jour et interroger une base de données relationnelle (en requêtes directes ou à travers une application)",
                        "Visualiser des données",
                        "Concevoir une base de données relationnelle à partir d'un cahier des charges"
                    ]
                },

                {
                    "list_title" : "Niveau 2",
                    "list" : [
                        "Optimiser les modèles de données de l’entreprise",
                        "Assurer la confidentialité des données (intégrité et sécurité)",
                        "Organiser la restitution de données à travers la programmation et la visualisation",
                        "Manipuler des données hétérogènes"
                    ]
                }
            ]
        },

        {
            "section_header" : "Compétence 5 : Conduire un projet",
            "section_contents" : "Planifier, organiser et piloter un projet informatique en tenant compte des besoins des utilisateurs, des contraintes organisationnelles et des critères de faisabilité.",
            "uls" : [
                {
                    "list_title" : "Niveau 1",
                    "list" : [
                        "Appréhender les besoins du client et de l'utilisateur",
                        "Mettre en place les outils de gestion de projet",
                        "Identifier les acteurs et les différentes phases d'un cycle de développement"
                    ]
                },

                {
                    "list_title" : "Niveau 2",
                    "list" : [
                        "Identifier les processus présents dans une organisation en vue d’améliorer les systèmes d’information",
                        "Formaliser les besoins du client et de l'utilisateur",
                        "Identifier les critères de faisabilité d’un projet informatique",
                        "Définir et mettre en œuvre une démarche de suivi de projet"
                    ]
                }
            ]
        },
        {
            "section_header" : "Compétence 6 : Travailler dans une équipe informatique",
            "section_contents" : "Collaborer efficacement au sein d'une équipe informatique en mobilisant des compétences interpersonnelles, en comprenant les enjeux organisationnels et en participant à la conduite du changement.",
            "uls" : [
                {
                    "list_title" : "Niveau 1",
                    "list" : [
                        "Appréhender l’écosystème numérique",
                        "Découvrir les aptitudes requises selon les différents secteurs informatiques",
                        "Identifier les statuts, les fonctions et les rôles de chaque membre d’une équipe pluridisciplinaire",
                        "Acquérir les compétences interpersonnelles pour travailler en équipe"
                    ]
                },

                {
                    "list_title" : "Niveau 2",
                    "list" : [
                        "Comprendre la diversité, la structure et la dimension de l’informatique dans une organisation (ESN, DSI, ...)",
                        "Appliquer une démarche pour intégrer une équipe informatique au sein d’une organisation",
                        "Mobiliser les compétences interpersonnelles pour travailler dans une équipe informatique",
                        "Rendre compte de son activité professionnelle"
                    ]
                },
                {
                    "list_title" : "Niveau 3",
                    "list" : [
                        "Organiser et partager une veille technologique et informationnelle",
                        "Identifier les enjeux de l’économie de l’innovation",
                        "Guider la conduite du changement informatique au sein d’une organisation"
                    ]
                }
            ]
        }
    ],
    "footer": ""
}